{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Allergist",
    "1": "Cardiologist",
    "2": "Dermatologist",
    "3": "Endocrinologist",
    "4": "Gastroenterologist",
    "5": "Gynecologist",
    "6": "Hepatologist",
    "7": "Internal Medicine",
    "8": "Neurologist",
    "9": "Osteopathic",
    "10": "Otolaryngologist",
    "11": "Pediatrician",
    "12": "Phlebologist",
    "13": "Pulmonologist",
    "14": "Rheumatologist"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Allergist": 0,
    "Cardiologist": 1,
    "Dermatologist": 2,
    "Endocrinologist": 3,
    "Gastroenterologist": 4,
    "Gynecologist": 5,
    "Hepatologist": 6,
    "Internal Medicine": 7,
    "Neurologist": 8,
    "Osteopathic": 9,
    "Otolaryngologist": 10,
    "Pediatrician": 11,
    "Phlebologist": 12,
    "Pulmonologist": 13,
    "Rheumatologist": 14
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.2.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
